### IMPORT NECESSARY LIBRARIES

In [1]:
import pandas as pd

### LOAD THE RAW FILES

In [2]:
sales_2017 = pd.read_csv("2017.csv")
sales_2018 = pd.read_csv("Sales-Transcations-2018.csv")
sales_2019 = pd.read_csv("Sales-Transcations-2019.csv")

print(sales_2017.shape)
print(sales_2018.shape)
print(sales_2019.shape)

(47290, 9)
(44740, 9)
(19176, 9)

In [3]:
sales_2017

,Date,Voucher,Party,Product,Qty,Rate,Gross,Disc,Voucher Amount
0,1/4/2017,Sal:1,SOLANKI PLASTICS,DONA-VAI-9100,2,"1,690.00","3,380.00",NaN,"13,100.00"
1,1/4/2017,Sal:1,SOLANKI PLASTICS,LITE FOAM(1200),6,"1,620.00","9,720.00",NaN,NaN
2,1/4/2017,Sal:2,SARNESWARA TRADERS,VISHNU CHOTA WINE,500,23,"11,500.00",NaN,"30,990.00"
3,1/4/2017,Sal:2,SARNESWARA TRADERS,LITE FOAM(1200),6,"1,620.00","9,720.00",NaN,NaN
4,1/4/2017,Sal:2,SARNESWARA TRADERS,DONA-VAI-9100,5,"1,690.00","8,450.00",NaN,NaN
...,...,...,...,...,...,...,...,...,...
47285,31/03/2018,Sal:10042,Vkp,10*10 SHEET,25,137,"3,425.00",NaN,"3,425.00"
47286,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
47287,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
47288,NaN,Total,NaN,NaN,"607,734.60","669,300.49","9,953,816.13","106,607.00","9,868,583.13"
47289,NaN,Total,NaN,NaN,"7,593,062.00","8,309,116.00","115,778,725.71","936,348.00","115,105,123.71"

In [4]:
sales_2018

,Date,Voucher,Party,Product,Qty,Rate,Gross,Disc,Voucher Amount
0,1/4/2018,Sal:146,TP13,SILVER POUCH 9*12,50,85,"4,250.00",NaN,"66,724.00"
1,1/4/2018,Sal:146,TP13,RUBBER,5,290,"1,450.00",NaN,NaN
2,1/4/2018,Sal:146,TP13,DURGA 10*12 Blue,"1,600.00",5.5,"8,800.00",NaN,NaN
3,1/4/2018,Sal:146,TP13,DURGA 13*16 BLUE,400,11,"4,400.00",NaN,NaN
4,1/4/2018,Sal:146,TP13,10*12 SARAS-NAT,600,8.1,"4,860.00",NaN,NaN
...,...,...,...,...,...,...,...,...,...
44735,31/03/2019,Sal:9610,HAMPI FOODS,SPOON SOOFY,200,40,"8,000.00",NaN,NaN
44736,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
44737,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
44738,NaN,Total,NaN,NaN,"666,056.00","1,067,808.80","10,796,991.30","29,999.00","10,787,647.30"
44739,NaN,Total,NaN,NaN,"7,097,803.00","10,024,197.00","117,897,671.80","720,204.00","117,427,983.80"

In [5]:
sales_2019

,Date,Voucher,Party,Product,Qty,Rate,Gross,Disc,Voucher Amount
0,1/4/2019,Sal:687,BALAJI PLASTICS,DONA-VAI-9100,1,"1,730.00","1,730.00",NaN,"3,460.00"
1,1/4/2019,Sal:687,BALAJI PLASTICS,SMART BOUL(48),1,"1,730.00","1,730.00",NaN,NaN
2,1/4/2019,Sal:688,BALAJI PLASTICS,Vishnu Ice,110,18.5,"2,035.00",NaN,"2,035.00"
3,,,28/3,,0,0,,,
4,1/4/2019,Sal:689,BALAJI PLASTICS,100LEAF -SP,3,585,"1,755.00",NaN,"1,755.00"
...,...,...,...,...,...,...,...,...,...
19171,10/10/2019,Sal:4935,K.SRIHARI,13*16 WHITE RK,400,16,"6,400.00",NaN,NaN
19172,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
19173,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
19174,NaN,Total,NaN,NaN,"99,284.90","175,381.65","2,203,649.50","20,680.00","2,189,014.50"
19175,NaN,Total,NaN,NaN,"2,710,193.00","5,519,888.40","53,360,791.40","672,984.00","52,830,224.40"

### STANDARDIZE COLUMN NAMES

In [6]:
def clean_columns(x):
    x.columns = x.columns.str.strip().str.lower().str.replace(" ", "_")
    return x

sales_2017 = clean_columns(sales_2017)
sales_2018 = clean_columns(sales_2018)
sales_2019 = clean_columns(sales_2019)

### COMBINE FILES

In [9]:
sales_all = pd.concat([sales_2017, sales_2018, sales_2019], ignore_index=True)

print("Combined Shape:", sales_all.shape)

Combined Shape: (111206, 9)

In [10]:
sales_all.shape

(111206, 9)

In [11]:
sales_all.head()

,date,voucher,party,product,qty,rate,gross,disc,voucher_amount
0,1/4/2017,Sal:1,SOLANKI PLASTICS,DONA-VAI-9100,2,"1,690.00","3,380.00",NaN,"13,100.00"
1,1/4/2017,Sal:1,SOLANKI PLASTICS,LITE FOAM(1200),6,"1,620.00","9,720.00",NaN,NaN
2,1/4/2017,Sal:2,SARNESWARA TRADERS,VISHNU CHOTA WINE,500,23,"11,500.00",NaN,"30,990.00"
3,1/4/2017,Sal:2,SARNESWARA TRADERS,LITE FOAM(1200),6,"1,620.00","9,720.00",NaN,NaN
4,1/4/2017,Sal:2,SARNESWARA TRADERS,DONA-VAI-9100,5,"1,690.00","8,450.00",NaN,NaN

#### why I'm removed three features becauese,
 1. gross  --- gross = quantity * rate, so it can always be recalculated.
 2. disc(discount) --- discount is optional, it can be added it later if required.
 3. voucher_amount --- It's invoice level feature , also causes aggregation confusion

##### So I considered only 6 Features

In [12]:
sales_all = sales_all[['date', 'voucher', 'party', 'product', 'qty', 'rate']]

print("After Column Selection:", sales_all.shape)

After Column Selection: (111206, 6)

In [13]:
sales_all.shape

(111206, 6)

### FIXING COLUMNS NAMES AND NUMERIC COLUMNS

In [14]:
# Remove commas
sales_all['qty'] = sales_all['qty'].astype(str).str.replace(',', '')
sales_all['rate'] = sales_all['rate'].astype(str).str.replace(',', '')

# Convert to numeric
sales_all['qty'] = pd.to_numeric(sales_all['qty'], errors='coerce')
sales_all['rate'] = pd.to_numeric(sales_all['rate'], errors='coerce')

In [15]:
print(sales_all.isna().sum())

date       12591
voucher    12557
party         40
product    12591
qty        15608
rate       15609
dtype: int64

### CONVERTING DATA INTO DATETIME FORMAT PROPERLY

In [16]:
sales_all['date'] = pd.to_datetime(
    sales_all['date'],
    dayfirst=True,
    errors='coerce'
)

In [17]:
sales_all['date'].isna().sum()

np.int64(15644)

### REMOVE ONLY BROKEN ROWS

In [18]:
sales_all = sales_all.dropna(subset=['date', 'qty', 'rate'])

print("Final Shape:", sales_all.shape)

Final Shape: (95561, 6)

#### GENERAL CHECKING :

In [19]:
sales_all.shape

(95561, 6)

In [20]:
sales_all

,date,voucher,party,product,qty,rate
0,2017-04-01,Sal:1,SOLANKI PLASTICS,DONA-VAI-9100,2.0,1690.0
1,2017-04-01,Sal:1,SOLANKI PLASTICS,LITE FOAM(1200),6.0,1620.0
2,2017-04-01,Sal:2,SARNESWARA TRADERS,VISHNU CHOTA WINE,500.0,23.0
3,2017-04-01,Sal:2,SARNESWARA TRADERS,LITE FOAM(1200),6.0,1620.0
4,2017-04-01,Sal:2,SARNESWARA TRADERS,DONA-VAI-9100,5.0,1690.0
...,...,...,...,...,...,...
111197,2019-10-10,Sal:4935,K.SRIHARI,16*20(100-W),140.0,26.0
111198,2019-10-10,Sal:4935,K.SRIHARI,10*12 KRISHNA-BK(10,600.0,8.4
111199,2019-10-10,Sal:4935,K.SRIHARI,13*16 Bk(100)KRISHN,320.0,16.0
111200,2019-10-10,Sal:4935,K.SRIHARI,10*12 RK,800.0,8.5
111201,2019-10-10,Sal:4935,K.SRIHARI,13*16 WHITE RK,400.0,16.0

In [21]:
print(sales_all.info())

<class 'pandas.core.frame.DataFrame'>
Index: 95561 entries, 0 to 111201
Data columns (total 6 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   date     95561 non-null  datetime64[ns]
 1   voucher  95561 non-null  object
 2   party    95561 non-null  object
 3   product  95561 non-null  object
 4   qty      95561 non-null  float64
 5   rate     95561 non-null  float64
dtypes: datetime64[ns](1), float64(2), object(3)
memory usage: 5.1+ MB
None

In [23]:
sales_all.describe()

                                date           qty           rate
count                          95561  95561.000000   95561.000000
mean   2018-06-10 00:18:17.619321856    182.160793     249.612310
min              2017-04-01 00:00:00      0.400000       0.010000
25%              2017-10-16 00:00:00     10.000000      16.000000
50%              2018-06-05 00:00:00     50.000000      28.000000
75%              2019-01-23 00:00:00    150.000000     140.000000
max              2019-10-10 00:00:00  35000.000000  200000.000000
std                              NaN    725.260269    2013.475202

In [24]:
sales_all.isnull().sum()

date       0
voucher    0
party      0
product    0
qty        0
rate       0
dtype: int64

### FINALLY SAVE MY FILE TO CSV

In [25]:
sales_all = sales_all.to_csv("Sales-Transcations-Cleaned")